talklist1= {
	talk1: [
		{img: "m1_npc_1f", name: "陌生人", msg: "远来的年轻人，你叫什么名字？" },
        {img: "fhero", name: "沃赫什·菲拉", msg: "我的名字叫沃赫什·菲拉。" },
        {img: "m1_npc_1f", name: "陌生人", msg: "我知道了，我在这里等你多日了。今天你可来了。" },
        {img: "fhero", name: "沃赫什·菲拉", msg: "等我？可我并不认识您啊。" },
        {img: "m1_npc_1f", name: "陌生人", msg: "你连日奔波辛苦了，请到帐篷来休息一下。让我慢慢讲给你听。" }
	],
	talk2: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "别随便进别人的帐篷。" }
	],
	talk3: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "这个山洞看起来很危险，我可不想进去。" },
	],
	talk4: [
		{img: "", x: 0, y: 0, name: "", msg: "你，沃赫什·菲拉，被自己老师追杀，逃亡到了荒漠。" },
		{img: "", x: 0, y: 0, name: "", msg: "老师阿塔木塔木的咆哮声似乎仍然在耳边回响——" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "小子，你真有两下子啊！" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "想不到你真的将成为拜星者的克星。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "这不是你的土地，不是你父亲的土地，也不是你先人的土地。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "这是我们的土地，我们的，懂吗？" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "我非杀了你不可！" },
		{img: "", x: 0, y: 0, name: "", msg: "好在你机敏地逃了出来。不过，你并不恨他，毕竟他曾经教过你很多东西。" },
	],
	talk5: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "赞美安拉，让我逢凶化吉，还得到了神鞭。" },
	],
	talk6: [
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "在地图上点击，就可以向相应的方向行走。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "如果点击自己的话，就会打开菜单。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "在物品列表里，长按物品就可以使用或者装备。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "在状态显示区里，长按装备可以卸下。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "如果有多名队员，在状态显示区里，左右滑动可以换人。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "走路碰到NPC会自动说话，碰到敌人就会发生战斗。" },
		{img: "m1_npc_4f", name: "阿塔木塔木", msg: "再给你一个忠告：经常保存进度，否则一旦遇到无法战胜的敌人就麻烦了。" },
	],
	talk7: [
		{img: "", x: 0, y: 0, name: "", msg: "只是到现在你已经两天两夜没有休息过了，筋疲力尽，饥渴难耐。" },
		{img: "", x: 0, y: 0, name: "", msg: "你希望能找到一些食物充饥。" },
	],
	talk8: [
		{img: "", x: 0, y: 0, name: "", msg: "灌木丛里有味道不错的浆果" },
	]
}
talklist2= {
	talk1: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "这里是蝙蝠的巢穴，如果捣毁了这里，蝙蝠都不会再出现了。" },
	],
	talk2: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "这里是蝎子的巢穴，如果捣毁了这里，蝎子就不会再出现了。" },
	],
	talk3: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "这里曾经是蝙蝠的巢穴，现在已经被捣毁。" },
	],
	talk4: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "这里曾经是蝎子的巢穴，现在已经被捣毁。" },
	],
	talk5: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "真不敢相信，终于逃出来了。" },
	],
	talk6: [
		{img: "m1_npc_1f", name: "陌生人", msg: "太好了！你真的拿到了神鞭！快把神鞭给我！" },
	],
	talk7: [
		{img: "m1_npc_1f", name: "陌生人", msg: "很好，谢谢你，年轻人。现在你可以永远留在这里和魔王作伴了！" },
	],
	talk8: [
		{img: "m1_npc_1f", name: "陌生人", msg: "看来只能动手抢了！" },
	]
}
talklist3= {
	talk1: [
		{img: "m1_npc_1f", name: "陌生人", msg: "这洞中有一个宝藏，被魔王占据。他有一根神鞭。" },
		{img: "m1_npc_1f", name: "陌生人", msg: "除了一个叫做沃赫什·菲拉的小伙子之外，谁都甭想碰一下。书里，就是这样写的。" },
		{img: "fhero", name: "沃赫什·菲拉", msg: "那条神鞭有什么用呢？" },
		{img: "m1_npc_1f", name: "陌生人", msg: "那鞭子可不简单哦，任何妖魔鬼怪都禁不住它的一下。" },
		{img: "m1_npc_1f", name: "陌生人", msg: "等你吃饱喝足之后，请你下洞去将那条神鞭给我拿来，我将帮你消除一切魔难。" },
	],
	talk2: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "好，我现在就去。" },
		{img: "m1_npc_1f", name: "陌生人", msg: "别着急，这个洞里相当危险，应该做好充分的准备。" },
		{img: "m1_npc_1f", name: "陌生人", msg: "拿着这些食物，如果你觉得累了，随时可以在对面那张床上休息一下。" },
		{img: "fhero", name: "沃赫什·菲拉", msg: "多谢。" },
	],
	talk3: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "让我再考虑考虑。" },
		{img: "m1_npc_1f", name: "陌生人", msg: "显然你是一个小心谨慎的人，考虑好了请告诉我。" },
	],
	talk4: [
		{img: "m1_npc_1f", name: "陌生人", msg: "拿到神鞭了么？" },
	],
	talk5: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "好好休息一下，明天见。" },
	],
	talk6: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "不可乱翻别人的箱子。" },
	],
	talk7: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "让我看看这里有什么。" },
		{img: "fhero", name: "沃赫什·菲拉", msg: "呵呵，收获不小啊。" },
	],
	talk8: [
		{img: "fhero", name: "沃赫什·菲拉", msg: "在这里睡觉是不明智的，还是尽快离开比较好。" },
	]
}
talklist4= {
	talk2: [
		{img: "bigdragonf", name: "魔王", msg: "你好大的胆子，竟敢闯到我的洞府来！" },
	]
}
